administracion/app/Models/CategoriasModel.php

SELECT *
FROM `categoria`
---
    public function getDataCategorias(){
        $this->select('*');
        return $this->findAll();