administracion/app/Models/ContactoModel.php

SELECT *
FROM `contactos`
---
    public function getDataContacto(){
        $this->select('*');
        return $this->findAll();