administracion/app/Models/MarcasModel.php

    public function getDataMarcas(){
        $this->select('*');
        return $this->findAll();
---
SELECT *
FROM `marca`