administracion/app/Models/UsuariosModel.php

    public function getDataUser(){
        $this->select('*');
        return $this->findAll();
---
SELECT *
FROM `usuario`